src/DataProcessors/ЗагрузитьКурсыВалют/ЗагрузитьКурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузитьКурсыВалют</name>
  <tabularSections>
    <name>Валюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/ЗагрузитьКурсыВалют/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	начальноеЗаполнение ();
	
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Период.ДатаНачала = НачалоДня ( ТекущаяДата () ) - 7 * 24 * 60 * 60; // предыдущая неделя
	Период.ДатаОкончания = КонецДня ( ТекущаяДата () );
	заполнитьВалюты ();	
	
КонецПроцедуры 

&НаСервере
Процедура заполнитьВалюты ()
	
	с = "
	|выбрать
	|	Ссылка как Валюта,
	|	истина как Использование
	|из
	|	Справочник.Валюты
	|где
	|	не ПометкаУдаления
	|	и Ссылка <> значение ( Справочник.Валюты.Гривна )  
	|упорядочить по 
	|	Наименование 
	|";
	запрос = Новый Запрос ( с );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Объект.Валюты.Очистить (); 
	Пока ( выборка.Следующий () ) Цикл
		новая = Объект.Валюты.Добавить ();
		ЗаполнитьЗначенияСвойств ( новая, выборка ); 
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьКурсы ( Команда) 
	
	загрузитьКурсыНаСервере ();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыНаСервере ()
	
	п = Новый Структура ();
	п.Вставить ( "ДатаНачала", Период.ДатаНачала );
	п.Вставить ( "ДатаОкончания", Период.ДатаОкончания );
	п.Вставить ( "Валюты", Объект.Валюты.Выгрузить ().ВыгрузитьКолонку ( "Валюта" ) );
	Обработки.ЗагрузитьКурсыВалют.ЗагрузитьКурсНБУ ( п ); 	
	
КонецПроцедуры
